Requests_control/src/Catalogs/Тематики/Тематики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тематики</name>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.Разделы</types>
    </type>
  </attributes>
  <attributes>
    <name>РедакцияКлассификатора</name>
    <type>
      <types>DefinedType.ДатаРедакцииКлассификатора</types>
    </type>
  </attributes>
</mdclass:Catalog>

Requests_control/src/Catalogs/Темы/Темы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Темы</name>
  <attributes>
    <name>Тематика</name>
    <type>
      <types>CatalogRef.Тематики</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РедакцияКлассификатора</name>
    <type>
      <types>DefinedType.ДатаРедакцииКлассификатора</types>
    </type>
  </attributes>
</mdclass:Catalog>

Requests_control/src/Catalogs/Вопросы/Вопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вопросы</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.Темы</types>
    </type>
  </attributes>
  <attributes>
    <name>РедакцияКлассификатора</name>
    <type>
      <types>DefinedType.ДатаРедакцииКлассификатора</types>
    </type>
  </attributes>
</mdclass:Catalog>

Requests_control/src/CommonModules/ПодборИзКлассификатораОбращенийГражданСервер/Module.bsl
#Область Программый_интерфейс

Функция ИнициализироватьКэшДанныхФормы(Форма) Экспорт
	
	// Кэш, использующийся при подборе из классификатора
	Форма.КэшДанныхФормы = Новый Структура(
		"ЭлементыКлассификатора, СтрокиДереваТематикИТем, СхемаКодаВопроса",
		Новый Соответствие,
		Новый Соответствие,
		Новый Соответствие);
		
	Форма.КэшДанныхФормы.ЭлементыКлассификатора.Вставить(0, Новый Структура("Тип, ПолеФормы, ТаблицаФормы", "Справочник.Разделы", "Раздел", "Разделы"));
	Форма.КэшДанныхФормы.ЭлементыКлассификатора.Вставить(1, Новый Структура("Тип, ПолеФормы, ТаблицаФормы", "Справочник.Тематики", "Тематика", "Тематики"));
	Форма.КэшДанныхФормы.ЭлементыКлассификатора.Вставить(2, Новый Структура("Тип, ПолеФормы, ТаблицаФормы", "Справочник.Темы", "Тема", "Темы"));
	Форма.КэшДанныхФормы.ЭлементыКлассификатора.Вставить(3, Новый Структура("Тип, ПолеФормы, ТаблицаФормы", "Справочник.Вопросы", "Вопрос", "Вопросы"));	
	
	Форма.КэшДанныхФормы.СхемаКодаВопроса.Вставить(Тип("СправочникСсылка.Разделы"), 0);
	Форма.КэшДанныхФормы.СхемаКодаВопроса.Вставить(Тип("СправочникСсылка.Тематики"), 1);
	Форма.КэшДанныхФормы.СхемаКодаВопроса.Вставить(Тип("СправочникСсылка.Темы"), 2);
	Форма.КэшДанныхФормы.СхемаКодаВопроса.Вставить(Тип("СправочникСсылка.Вопросы"), 3);	
	
КонецФункции

Функция ПолучитьЭлементКлассификатора(ТипЭлемента, КодЭлемента) Экспорт
	
	Результат = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ТипЭлемента).ПустаяСсылка();
	
	Запрос = Новый Запрос(СтрШаблон("ВЫБРАТЬ Ссылка ИЗ %1 
		|ГДЕ Код = &КодЭлемента И Не ПометкаУдаления И РедакцияКлассификатора = &РедакцияКлассификатора", ТипЭлемента));
	Запрос.УстановитьПараметр("КодЭлемента", КодЭлемента);
	Запрос.УстановитьПараметр("РедакцияКлассификатора", ОбщегоНазначенияПовтИсп.РедакцияКлассификатора());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КлассификаторОбращенийНеЗаполнен() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ	Справочник.Разделы
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ	Справочник.Тематики
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ	Справочник.Темы
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ	Справочник.Вопросы");
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область Служебные_процедуры_и_функции

#КонецОбласти
